{
  "1972d32c5a5fcc8f31c97ef3a5323e0d": {
    "summary": "Researchers from SMART DiSTAP developed a near-infrared fluorescent nanosensor that can monitor the primary plant growth hormone, indole-3-acetic acid, in real-time without harming the plant.",
    "fetch_date": "2025-06-09T17:13:37.186342",
    "title": "Universal nanosensor unlocks the secrets to plant growth"
  },
  "47ab9a16e29e08ffa40b8e5d1a2d33e0": {
    "summary": "MIT researchers created a machine learning-based adaptive control algorithm that enables autonomous drones to adjust their flight paths in response to unpredictable disturbances like gusting winds.",
    "fetch_date": "2025-06-09T17:13:37.186342",
    "title": "AI-enabled control system helps autonomous drones stay on target in uncertain environments"
  },
  "f3d8421e9a306ba1f336ddd1960b6a58": {
    "summary": "The winning essay of the Envisioning the Future of Computing Prize highlights the potential for AI-driven health care technologies to exacerbate existing health care disparities.",
    "fetch_date": "2025-06-09T17:13:37.186342",
    "title": "Envisioning a future where health care tech leaves some behind"
  },
  "48c77f33755a717be4f870c80b8684f9": {
    "summary": "Coactive, founded by MIT alumni, has developed an AI-powered platform designed to extract new insights from various types of content, including video.",
    "fetch_date": "2025-06-09T17:13:37.186342",
    "title": "Helping machines understand visual content with AI"
  },
  "0339354a56cfc40a5f7a1735bcfa1c32": {
    "summary": "New research indicates that a specific brain region involved in navigation uses distinct neural activity patterns to encode competing hypotheses about ambiguous landmarks.",
    "fetch_date": "2025-06-09T17:13:37.186342",
    "title": "How the brain distinguishes between ambiguous hypotheses"
  },
  "d13f9ab54be5400280e1c19c4cfe9130": {
    "summary": "MIT researchers developed a new animation technique that allows for more stable and realistic simulations of elastic objects, benefiting both animators and engineers.",
    "fetch_date": "2025-06-09T17:13:43.380591",
    "title": "Animation technique simulates the motion of squishy objects"
  },
  "f6e638888c10e8812e948d459ceddbdc": {
    "summary": "In \"Dune: Awakening,\" players can build bases in the desert to survive harsh conditions, but these bases are designed to be temporary as players progress in the game.",
    "fetch_date": "2025-06-09T17:13:43.380591",
    "title": "Dune Awakening base building guide: Best locations and design tips"
  },
  "aadf5fd4c538df7e1187d2e024dc94d7": {
    "summary": "A recent event promoting \"Death Stranding 2\" was criticized for focusing more on praise for Hideo Kojima than providing substantial information about the game's themes or gameplay.",
    "fetch_date": "2025-06-09T17:13:43.380591",
    "title": "I love Hideo Kojima's games, but last night's fawning over his genius from Geoff Keighley and the De"
  },
  "604b89d8a9f952594ba2b34a47db3afe": {
    "summary": "IO Interactive's upcoming game \"007 First Light\" aims to differentiate James Bond from Agent 47 by emphasizing Bond's distinct personality and narrative depth.",
    "fetch_date": "2025-06-09T17:13:43.380591",
    "title": "'If Hitman is a single-minded killer and basically the bad guy of the game, Bond is the hero': IO In"
  },
  "938d372df0da8f75b4da5516fd7b50a9": {
    "summary": "The PC Gaming Show 2025 showcased a high-end gaming PC build called \"The Rig,\" featuring top-tier components including an AMD Ryzen 9 processor and GIGABYTE graphics card.",
    "fetch_date": "2025-06-09T17:13:43.380591",
    "title": "Introducing ‘The Rig’: Everything under the hood of the PC Gaming Show’s top of the line PC build"
  },
  "265af4d1d87e6ec949e77397a525ee8f": {
    "summary": "Noble Legacy is a third-person medieval city builder where players develop a town by collecting resources and attracting new citizens, with a demo now available on Steam.",
    "fetch_date": "2025-06-09T17:13:48.754730",
    "title": "Medieval Dynasty fans should check out this third-person medieval city builder that just got a demo "
  },
  "d0757366239b47400ea1518d247ab8a5": {
    "summary": "At Fate's End is an action-adventure game announced by Thunder Lotus that features family-themed combat where players can use their own body parts as weapons.",
    "fetch_date": "2025-06-09T17:13:48.754730",
    "title": "At Fate's End is a gorgeous action adventure where you can pull a 'legendary God Sword' from your th"
  },
  "aa87746d67a514e47ab5113532c2a515": {
    "summary": "The GIGABYTE X870E AORUS Master motherboard is designed for AMD’s AM5 processors, offering advanced thermal management and high-speed connectivity for gaming PCs.",
    "fetch_date": "2025-06-09T17:13:48.754730",
    "title": "GIGABYTE AORUS: the premier choice for an AMD gaming PC"
  },
  "99a56cf744cd6c3649d21705d5c8538b": {
    "summary": "Dying Light: The Beast is a direct sequel to the original Dying Light, focusing on survival horror elements and featuring the return of main character Kyle Crane, addressing criticisms of Dying Light 2.",
    "fetch_date": "2025-06-09T17:13:48.754730",
    "title": "Techland boss says Dying Light 2 'forgot' what made the series special, but Dying Light: The Beast g"
  },
  "884e33f7c970041208336fae10909d52": {
    "summary": "New research from Michigan State University has brought scientists closer to understanding the origins of cosmic rays, identifying a pulsar wind nebula associated with a significant cosmic ray source.",
    "fetch_date": "2025-06-09T17:13:48.754730",
    "title": "Where did cosmic rays come from? Astrophysicists are closer to finding out"
  },
  "fb49206d9218d9c78a843ce226233a72": {
    "summary": "Researchers at the Facility for Rare Isotope Beams have found that cobalt-70 isotopes can adopt different nuclear shapes corresponding to slightly different energy levels.",
    "fetch_date": "2025-06-09T17:13:55.842475",
    "title": "How an atomic nucleus can have two different shapes with only slightly different energy levels"
  },
  "978bb82773ee9ea461e7f47fb2d1a4a8": {
    "summary": "A study indicates that emerging pollutants are worsening the water crisis in developing countries, with freshwater demand projected to rise by 55% by 2050.",
    "fetch_date": "2025-06-09T17:13:55.842475",
    "title": "Emerging pollutants are aggravating water crisis in developing countries, say researchers"
  },
  "c1032fbdc3ee42973f3668b79fb286a8": {
    "summary": "Gene pyramiding, combining the pepy-1 and Pepy-2 genes, significantly enhances pepper plants' resistance to viral diseases compared to those with fewer or no resistance genes.",
    "fetch_date": "2025-06-09T17:13:55.842475",
    "title": "Protecting peppers from devastating viral diseases through gene pyramiding"
  },
  "763b69d836a79e2b7728c8a3e995dda4": {
    "summary": "Vicki Ferrini, a marine geophysicist, emphasizes the importance of open source data in mapping the world's oceans as part of the Nippon Foundation-GEBCO Seabed 2030 Project.",
    "fetch_date": "2025-06-09T17:13:55.842475",
    "title": "Q&A: Leveraging the power of open source data to map the world's oceans"
  },
  "37e2564f03e91321ab999d14bb3149ea": {
    "summary": "The Boltz-2 model, developed by MIT and Recursion, achieves state-of-the-art performance in predicting protein binding affinity, enhancing AI's role in drug discovery.",
    "fetch_date": "2025-06-09T17:13:55.842475",
    "title": "Protein-binding affinity model expands role of AI in drug discovery"
  },
  "8647a1c59d281ed4de031bf151cdfe85": {
    "summary": "Researchers at the University of Rochester have discovered that certain bat species possess genetic and immune system traits that significantly reduce their cancer risk, allowing them to live up to 35 years without developing the disease.",
    "fetch_date": "2025-06-09T17:14:01.238354",
    "title": "Why don't bats get cancer? Researchers discover protection from genes and strong immune systems"
  },
  "119d162e8cc5d89b706cf5a2cbd5525a": {
    "summary": "New soil models developed by the Chinese Academy of Sciences aim to enhance the safety of wheat crops by addressing cadmium contamination, which poses a significant threat to food safety.",
    "fetch_date": "2025-06-09T17:14:01.238354",
    "title": "Soil models may improve safety of wheat amid cadmium contamination"
  },
  "6460ae860e10288e6bc4853afaed2025": {
    "summary": "Apple's upcoming iOS 26 update will feature a major redesign along with various new functionalities aimed at improving user experience on iPhones.",
    "fetch_date": "2025-06-09T17:14:01.238354",
    "title": "The biggest changes coming to your iPhone with iOS 26"
  },
  "3f9f2f8bdb514c632b74fd54928a9bcc": {
    "summary": "Retroid has introduced a $69 clamp-on secondary screen accessory that allows modern handheld gaming devices to emulate the dual-screen design of the Nintendo DS.",
    "fetch_date": "2025-06-09T17:14:01.238354",
    "title": "Retroid&#8217;s $69 second screen is ready for your favorite DS games"
  },
  "2968bd636ec60292ba8a8d1d81cbe781": {
    "summary": "Hulu's animated film \"Predator: Killer of Killers\" serves as a prequel to the franchise, exploring its backstory in a concise and engaging manner.",
    "fetch_date": "2025-06-09T17:14:01.238354",
    "title": "Predator: Killer of Killers is a short and sweet joyride through the franchise&#8217;s secret past"
  },
  "41ce52b08204f3decc1068efcb514aaf": {
    "summary": "Roku is testing a new homepage design that includes shortcuts to frequently used apps and a consolidated view of subscription-based content for select users.",
    "fetch_date": "2025-06-09T17:14:06.131612",
    "title": "Roku is testing a new look"
  },
  "584dd952aeae6e8114363a248ed5c21d": {
    "summary": "The Kindle Scribe is currently available at its lowest price ever, with a $100 discount.",
    "fetch_date": "2025-06-09T17:14:06.131612",
    "title": "Here are the best Kindle deals right now"
  },
  "ccad42a33bf14678b569937e89cec1d4": {
    "summary": "Apple's new \"Liquid Glass\" design language, introduced at WWDC 2025, emphasizes a translucent and glassy aesthetic but does not significantly depart from previous design principles.",
    "fetch_date": "2025-06-09T17:14:06.131612",
    "title": "Apple’s Liquid Glass redesign doesn’t look like much"
  },
  "610d9923246f5a3e627550835a793720": {
    "summary": "iOS 26 will introduce widgets and message tapbacks to Apple CarPlay, enhancing its usability and aesthetics in compatible vehicles.",
    "fetch_date": "2025-06-09T17:14:06.131612",
    "title": "Apple CarPlay is getting widgets and message tapbacks this fall with iOS 26"
  },
  "37ac6f5174999efa7d0bf25fcd77b814": {
    "summary": "At WWDC 2025, Apple unveiled updates to its operating systems, introduced the \"Liquid Glass\" design language, and announced new features for developers, including access to on-device Apple Intelligence.",
    "fetch_date": "2025-06-09T17:14:06.131612",
    "title": "WWDC 2025: all the news from Apple&#8217;s annual developer conference"
  },
  "f74dafc5121169bc4b877e57bc9b969c": {
    "summary": "A study from Rutgers Health reveals that ciprofloxacin induces an energy crisis in E. coli, which enhances bacterial survival and accelerates the evolution of antibiotic resistance.",
    "fetch_date": "2025-06-09T17:14:12.957638",
    "title": "How a common antibiotic fuels bacterial resistance"
  },
  "b7cb9dd0e510f2e4ea7ae409a6cce4c6": {
    "summary": "Tumor Treating Fields therapy, when combined with immunotherapy and chemotherapy, may extend survival in glioblastoma patients by disrupting tumor growth and enhancing immune response.",
    "fetch_date": "2025-06-09T17:14:12.957638",
    "title": "Shocking brain cancer breakthrough: Electric fields supercharge immune assault"
  },
  "14e021d0b18fda7e25310aad7a2aaa41": {
    "summary": "Research indicates that the ventral tegmental area (VTA) in the brain predicts rewards by releasing dopamine in response to signals associated with rewards rather than the rewards themselves.",
    "fetch_date": "2025-06-09T17:14:12.957638",
    "title": "The dopamine clock: How your brain predicts when you’ll feel good"
  },
  "112eb7f78ba7be72a2550fbe9bc38999": {
    "summary": "A study finds that teenage girls using multiple skincare products promoted on TikTok face risks of skin irritation and allergy, with many regimens costing over $168 monthly.",
    "fetch_date": "2025-06-09T17:14:12.957638",
    "title": "Burning for Beauty: How TikTok Skin Trends Are Harming Young Girls"
  },
  "2126d59b779e77a39fa1f6cf9986d6f5": {
    "summary": "The Krakencoder method predicts brain function 20 times more accurately than previous techniques by mapping the relationship between the brain's anatomical connections and activity patterns.",
    "fetch_date": "2025-06-09T17:14:12.957638",
    "title": "Krakencoder predicts brain function 20x better than past methods"
  },
  "2a77b176b65ae8ebbdf8c52fe16376cf": {
    "summary": "A study found that nicotinamide riboside supplementation can reverse premature aging effects in patients with Werner syndrome by increasing levels of nicotinamide adenine dinucleotide (NAD+).",
    "fetch_date": "2025-06-09T17:14:20.837124",
    "title": "Common supplement reverses premature aging in landmark human trial"
  },
  "c8550e4be441ed3b1b86cfdafc276409": {
    "summary": "Research indicates that ecosystems of large herbivores remained stable over 60 million years despite species extinction, but faced global reorganization during two significant environmental shifts.",
    "fetch_date": "2025-06-09T17:14:20.837124",
    "title": "Why past mass extinctions didn't break ecosystems—But this one might"
  },
  "8fa530ec0c6428cf211e1e7db7380b01": {
    "summary": "Linear's new diagnostic platform can detect bacterial and viral infections, including STIs, in as little as five minutes using its Exponential Amplification (EXPAR) technology.",
    "fetch_date": "2025-06-09T17:14:20.837124",
    "title": "5-minute STI test poised to transform sexual health diagnostics"
  },
  "ecf238ca702bcc5ab2440f2e1e13b8f3": {
    "summary": "Evidence from the Mindoro Archaeology Project suggests that anatomically modern humans in the Philippines developed advanced maritime technology for sea-crossings over 35,000 years ago.",
    "fetch_date": "2025-06-09T17:14:20.837124",
    "title": "New evidence reveals advanced maritime technology in the philippines 35,000 years ago"
  },
  "db788e5b0cb28dc235710f81a4a89507": {
    "summary": "A study reveals that solid rock flows in the Earth's D\" layer, approximately 3,000 kilometers below the surface, challenging previous understandings of material behavior at that depth.",
    "fetch_date": "2025-06-09T17:14:20.837124",
    "title": "Earth's core mystery solved: How solid rock flows 3,000 kilometers beneath us"
  },
  "b759e658c697d9e54bfa6294214cfe70": {
    "summary": "At WWDC 25, Apple announced that the highly anticipated AI-powered Siri update will require more time to meet quality standards, indicating it may not be available until 2026.",
    "fetch_date": "2025-06-09T17:14:27.925057",
    "title": "Still no AI-powered, ‘more personalized’ Siri from Apple at WWDC 25"
  },
  "fd863400314a25ae413e4d2da6ebb826": {
    "summary": "OpenAI reported reaching $10 billion in annual recurring revenue, significantly up from $5.5 billion the previous year, driven by its consumer products and API services.",
    "fetch_date": "2025-06-09T17:14:27.925057",
    "title": "OpenAI claims to have hit $10B in annual revenue"
  },
  "ce086902e8c63ddf55b9891bca56f2be": {
    "summary": "Apple introduced updates to visionOS 26, enhancing its mixed reality headset with customizable spatial widgets that integrate digital content into users' physical environments.",
    "fetch_date": "2025-06-09T17:14:27.925057",
    "title": "From spatial widgets to realistic Personas: All the visionOS updates Apple announced at WWDC"
  },
  "7578711a16b47aad65f2df6ed1607bda": {
    "summary": "At WWDC 2025, Apple unveiled an AI-powered Shortcuts app that allows users to leverage on-device large language models for personalized automation tasks.",
    "fetch_date": "2025-06-09T17:14:27.925057",
    "title": "At WWDC 2025, Apple introduces an AI-powered Shortcuts app"
  },
  "4bc8e4971ca322770f24d4075fd40b7a": {
    "summary": "Apple launched Workout Buddy, an AI workout coach that provides real-time feedback and encouragement during workouts by analyzing user data and utilizing generative voice technology.",
    "fetch_date": "2025-06-09T17:14:27.925057",
    "title": "Apple’s new Workout Buddy helps you sweat smarter"
  },
  "81cd867b88d5695abfb3509cdcff13dc": {
    "summary": "Apple announced the integration of its Visual Intelligence AI technology into the iPhone screen with iOS 26, enabling automatic image analysis and contextual shortcuts across apps.",
    "fetch_date": "2025-06-09T17:14:37.497441",
    "title": "Apple brings Apple Intelligence to the iPhone screen at WWDC 2025"
  },
  "d93b0eddcb6e5db8fa10495f7da043b9": {
    "summary": "Apple introduced Live Translation for Messages, FaceTime, and Phone calls, allowing real-time translation of conversations on-device to maintain user privacy.",
    "fetch_date": "2025-06-09T17:14:37.497441",
    "title": "Apple introduces live translation across Messages, FaceTime, and Phone at WWDC 25"
  },
  "9686461292a2bea962b2d77e80ac0a8e": {
    "summary": "Apple launched the Foundation Models framework, enabling developers to utilize its on-device AI models offline for enhanced app experiences without cloud dependency.",
    "fetch_date": "2025-06-09T17:14:37.497441",
    "title": "Apple lets developers tap into its offline AI models"
  },
  "150974686e25f18659d1040853307b9c": {
    "summary": "Corporate AI adoption in the U.S. appears to be leveling off at 41%, with 49% of large businesses having deployed AI, according to data from fintech company Ramp.",
    "fetch_date": "2025-06-09T17:14:37.497441",
    "title": "Corporate AI adoption may be leveling off, according to Ramp data"
  },
  "be806c3999f6e2102a48568301d6171b": {
    "summary": "XRobotics developed a countertop robot, the xPizza Cube, capable of producing up to 100 pizzas an hour, significantly reducing preparation time for pizza restaurants.",
    "fetch_date": "2025-06-09T17:14:37.497441",
    "title": "XRobotics’ countertop robots are cooking up 25,000 pizzas a month"
  },
  "2faf42d3cc85c946a5f6596f7f7e0f23": {
    "summary": "Nico Parker addressed online criticism regarding her casting as Astrid in the live-action remake of \"How to Train Your Dragon,\" emphasizing that she cannot value opinions based on her appearance compared to the animated character.",
    "fetch_date": "2025-06-09T17:14:43.180174",
    "title": "‘How to Train Your Dragon’ Star Nico Parker Reacts to Trolls About Her Casting: “I Can’t Value Your "
  },
  "9cb17ec58b5cd359a8cfa29f10e1416e": {
    "summary": "The Wonder Project has launched a screenwriting fellowship in partnership with Stand Together Trust to support emerging writers in telling true-life stories that convey hope and progress.",
    "fetch_date": "2025-06-09T17:14:43.180174",
    "title": "Ex-Marvel Exec Launches Screenwriting Fellowship With an Inspirational Focus (Exclusive)"
  },
  "24a7454c680b322403f7faf5949f0054": {
    "summary": "The documentary \"Andy Kaufman Is Me\" offers a familiar exploration of the iconic comic's life and career but lacks new insights compared to previous works.",
    "fetch_date": "2025-06-09T17:14:43.180174",
    "title": "‘Andy Kaufman Is Me’ Review: Solid but Unrevelatory Doc Uses Puppetry to Tackle the Iconic Comic"
  },
  "cbdb9afe9c2f060f3e14ae128a2eccb1": {
    "summary": "The UK is enhancing its position as a leader in AI by partnering with NVIDIA to address the skills gap and attract private investment in AI startups.",
    "fetch_date": "2025-06-09T17:14:43.180174",
    "title": "UK tackles AI skills gap through NVIDIA partnership"
  },
  "7907bcb4b1b0bd6945165197b5dfc832": {
    "summary": "Anthropic has introduced a series of Claude AI models specifically designed for use by US national security agencies, marking a significant development in AI applications within classified environments.",
    "fetch_date": "2025-06-09T17:14:43.180174",
    "title": "Anthropic launches Claude AI models for US national security"
  },
  "bdb77044319fadb48c8388946af2b469": {
    "summary": "The Smart Data & AI Summit in Riyadh, scheduled for August 2025, aims to advance Saudi Arabia's digital transformation by gathering over 300 data and AI professionals.",
    "fetch_date": "2025-06-09T17:14:48.142280",
    "title": "The Kingdom’s digital transformation showcased at Smart Data & AI Summit"
  },
  "dc76b0d4a098384c40c46cdf07e6ac15": {
    "summary": "Reddit has filed a lawsuit against Anthropic, alleging that the company used data from its platform to develop AI models without permission.",
    "fetch_date": "2025-06-09T17:14:48.142280",
    "title": "Reddit sues Anthropic over AI data scraping"
  },
  "9d25c5818d5460473007b8b6981ae6f2": {
    "summary": "Kieran Norton from Deloitte will discuss the importance of AI deployment, security, and governance at the TechEx North America event on June 4-5.",
    "fetch_date": "2025-06-09T17:14:48.142280",
    "title": "The modern ROI imperative: AI deployment, security and governance"
  },
  "35a6876216eab3d046841c58d2de9aaf": {
    "summary": "The responsible deployment of enterprise AI can help business leaders transition from merely enabling data use to achieving strategic leadership through real-time insights.",
    "fetch_date": "2025-06-09T17:14:48.142280",
    "title": "AI enables shift from enablement to strategic leadership"
  },
  "30337b14e09807fffd284b1367d17b49": {
    "summary": "In 1994, tobacco CEOs testified before Congress claiming that nicotine is not addictive, a statement that has been widely criticized and contradicted by subsequent research.",
    "fetch_date": "2025-06-09T17:14:48.142280",
    "title": "Tobacco CEOs testify: \"Nicotine is not addictive\" (1994)"
  },
  "092836c303d171c214d2afa4764cbe43": {
    "summary": "The Containerization package enables the use of Linux containers on macOS by utilizing Swift and Apple's Virtualization.framework, allowing for efficient management and execution of containerized applications.",
    "fetch_date": "2025-06-09T17:14:53.200738",
    "title": "Containerization is a Swift package for running Linux containers on macOS"
  },
  "7e3d94f9ac9948f6523fcf135213eac1": {
    "summary": "A report claims that voting machines were tampered with prior to the 2024 elections, raising concerns about election integrity.",
    "fetch_date": "2025-06-09T17:14:53.200738",
    "title": "Report claims voting machines were tampered with before 2024 elections"
  },
  "6e8216e9f90866a82e63d79b51b99824": {
    "summary": "Astronomers have discovered a mysterious object, ASKAP J1832-0911, that emits pulses of radio waves and X-rays every 44 minutes, with its nature currently unexplained.",
    "fetch_date": "2025-06-09T17:14:53.200738",
    "title": "Object firing signals at Earth every 44 minutes"
  },
  "b613adabf3277964f2208dca304c1fdc": {
    "summary": "The article discusses new encrypted messaging features on Twitter/X, emphasizing the importance of cryptography for user privacy.",
    "fetch_date": "2025-06-09T17:14:53.200738",
    "title": "A bit more on Twitter/X's new encrypted messaging"
  },
  "e7316ef5f9ea25f668716f67843c700b": {
    "summary": "Somo is introduced as a user-friendly alternative to netstat for monitoring sockets and ports on Linux, featuring an interactive table view and simplified command usage.",
    "fetch_date": "2025-06-09T17:14:53.200738",
    "title": "Show HN: Somo – a human friendly alternative to netstat"
  },
  "55c3aff46f325cfaf4f528cda5b4fc2d": {
    "summary": "Apple announced new developer tools and enhancements, including on-device AI models and large language model integration in Xcode, to improve app development across its platforms.",
    "fetch_date": "2025-06-09T17:14:58.558202",
    "title": "Apple announces Foundation Models and Containerization frameworks, etc"
  },
  "58e049d9acc90fe4e4d04ac974a4d068": {
    "summary": "Munal OS is an experimental operating system written in Rust that features a graphical interface, WASM sandboxing for security, and aims to explore modern OS design principles.",
    "fetch_date": "2025-06-09T17:14:58.558202",
    "title": "Show HN: Munal OS: a graphical experimental OS with WASM sandboxing"
  },
  "1b6ae34826f05bce254818365354eda1": {
    "summary": "Frederick Forsyth, the acclaimed author known for his thriller \"The Day of the Jackal,\" has passed away at the age of 86 after a brief illness.",
    "fetch_date": "2025-06-09T17:14:58.558202",
    "title": "Frederick Forsyth has died"
  },
  "dd090784b35a87292f3b5d9f7e1103a8": {
    "summary": "Apple introduced a new universal software design across its platforms, utilizing a material called Liquid Glass to enhance content focus and maintain familiarity.",
    "fetch_date": "2025-06-09T17:14:58.558202",
    "title": "Apple introduces a universal design across platforms"
  }
}